import React from 'react'
import "./styles/Background.css";
import { Container } from '@mui/system';
import { Grid } from '@material-ui/core';
import 'animate.css';

function Background() {
  return ( 
    <div className='background'>
         <Container>
         <h1 id='Initiation-text'>পটভূমি</h1>
            <Grid container spacing={3}>
              <Grid item md={2}>
                 
              </Grid>
                <Grid item md={8}>
                  <div className='Text-1 animate__animated animate__fadeInDown'>
                        <p>     চতুর্থ শিল্পবিপ্লব এর সাথে তাল মিলিয়ে আইসিটি, প্রোগ্রামিং, রোবটিক্স, ও ফ্রিল্যান্সিং ইত্যাদি কার্যক্রমের মাধ্যমে দক্ষ মানবসম্পদ উন্নয়নের লক্ষ্যে জেলা ও উপজেলা পর্যায়ের সকল কর্মকর্তাদের সাথে রোবটিক্স ও প্রোগ্রামিং বিষয়ে মতবিনিময় করা হয়। 
     জেলা প্রশাসন, কুমিল্লা কর্তৃক ২০২১-২০২২ অর্থবছরের বার্ষিক কর্মসম্পাদন চুক্তি (এপিএ)-তে বিজ্ঞান বিষয়ক সভা/সেমিনার ও ব্যবহারিক প্রদর্শীর, আয়োজন করা হয়।
     শুরুতে জেলা পর্যায়ে ১ম ও ২য় ধোপে মোট ৯৩৩ জন শিক্ষার্থীকে  রোবটিক্স ও প্রোগ্রামিং বিষয়ক ওরিয়েন্টেশন প্রদান করা হয়। 
     উপজেলা পর্যায়ে একইভাবে ১৮৯৫ জনকে ওরিয়েন্টেশন প্রদান করা হয়।
     
      
     জেলা ও উপজেলায় মূল্যায়নের মাধ্যমে ১২৭৪ জনকে রোবটিক্স ও প্রোগ্রামিং বিষয়ে বিস্তারিত প্রশিক্ষণ  প্রদান করা হয়। 
    তন্মধ্যে ২৬০ জন শিক্ষার্থীকে রিফ্রেশার কোর্সের মাধ্যমে ক্ষুদে প্রোগ্রামার হিসেবে গড়ে তোলা হয়েছে। 
     প্রশিক্ষণপ্রাপ্তরা অরড্যুনো প্রোগ্রামিং করে ড্যান্সিং রোবট 'টেলসন',  অবস্টকেল এভয়েডিং ডগ রোবট 'পিসকো', স্পাইডার রোবট মিরুসহ কথা বলতে পারা কিংবা মানুষের মতো হাঁটতে সক্ষম ছোট ছোট রোবট নিজেরা বানিয়ে প্রদর্শন করেছে।  </p>
                  </div>
                
                </Grid>
            </Grid>
            <Grid container spacing={3}>

              <Grid item md={2}>

              </Grid>
              <Grid item md={8}>
                  <div className='Text-2 animate__animated animate__fadeInDown'>
                        <p>
                         জেলা ও উপজেলায় মূল্যায়নের মাধ্যমে ১২৭৪ জনকে রোবটিক্স ও প্রোগ্রামিং বিষয়ে বিস্তারিত প্রশিক্ষণ  প্রদান করা হয়। 
     তন্মধ্যে ২৬০ জন শিক্ষার্থীকে রিফ্রেশার কোর্সের মাধ্যমে ক্ষুদে প্রোগ্রামার হিসেবে গড়ে তোলা হয়েছে। 
     প্রশিক্ষণপ্রাপ্তরা অরড্যুনো প্রোগ্রামিং করে ড্যান্সিং রোবট 'টেলসন',  অবস্টকেল এভয়েডিং ডগ রোবট 'পিসকো', স্পাইডার রোবট মিরুসহ কথা বলতে পারা কিংবা মানুষের মতো হাঁটতে সক্ষম ছোট ছোট রোবট নিজেরা বানিয়ে প্রদর্শন করেছে। 
                        </p>
                  </div>
              </Grid>
            </Grid>

         </Container>
    </div>
  )
}

export default Background;